"""
运行碳披露、碳中和系统
"""
import os
import re
import sys
import json
import requests

if True:
    current_path = os.path.abspath(os.path.dirname(__file__))
    superior_path = os.path.join(current_path, "..")
    sys.path.append(superior_path)
    from common.custom.logger import Log


system_1_indicators = [
    {
        "一级指标": "股东和投资者",
                "需求目的": "投资与融资决策依据；企业低碳战略及管理决策依据",
                "二级指标": [
                    {
                        "二级指标名称": "碳排放风险与机遇",
                        "三级指标": [
                            {
                                "三级指标名称": "碳减排过程中的风险识别与评估",
                                "keywords": "环境风险,环保风险,碳中和风险,能源风险,节能风险,极端气候,气候风险,TCFD,(风险),(碳),(环境),(绿色),(环保),[评估],[气候],[转型],[压力测试],[测试],[声誉风险],[披露],[声誉],[应急],[压力情景],[压力],[情景],[转型],[识别],[气候变化],[风险管理],[技术风险]"
                            },
                            {
                                "三级指标名称": "气候变化给企业带来的财务风险",
                                "keywords": "(碳),(气候),(极端天气),[财务风险],[成本增加],[价格],[浮动],[研发成本],[研发投入],[营业收入],[财务],[业绩],[利润],[绩效],[业务],[需求],[投资组合价值],[投资],[利益],[收入],[经营],[营业],[损失],[资产],[业务]"
                            },
                            {
                                "三级指标名称": "企业碳排放所受的政府管制风险",
                                "keywords": "(气候),(环保),(碳),[政策风险],[法律风险],[法规风险],[合规],[政策],[监管],[合规成本],[碳交易市场],[政策法规],[法律责任],[诉讼],[政府管控],[措施],[管控],[定价],[双控],[约束],[依法追究],[限排],[强制],[出台]"
                            },
                            {
                                "三级指标名称": "碳减排可能给企业带来的机遇",
                                "keywords": "(碳),(气候),(环保),[机遇],[成本节约],[减少成本],[降低成本],[增加收入],[应对],[适应力],[挑战],[发展趋势],[发展前景],[机会],[竞争优势],[提高]"
                            },
                            {
                                "三级指标名称": "碳汇过程中的可逆性风险（如森林火灾等）",
                                "keywords": "森林火灾"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳减排战略",
                        "三级指标": [
                            {
                                "三级指标名称": "高管致辞",
                                "keywords": "致辞部分+碳"
                            },
                            {
                                "三级指标名称": "未来展望",
                                "keywords": "(碳),(绿色),(环保),[未来],[展望],[深入],[持续],[发展],[推动],[践行],[打造],[贯彻],[加快],[深耕],[不断完善],[坚持],[继续],[探索],[构建],[新阶段],[贡献力量],[进一步],[引领]"
                            },
                            {
                                "三级指标名称": "碳排放目标",
                                "keywords": "(温室气体),(碳),(绿色),(环保),(环境),(清洁能源),[2030],[2060],[计划],[预计],[争取],[力争],[承诺],[目标],[致力于],[变革],[长期],[2025],[实现],[十四五],[2050],[基准],[实现],[逐年],[递减],[完成],[2045],[升级]"
                            },
                            {
                                "三级指标名称": "企业短、中、长期应对低碳的战略规划",
                                "keywords": "(碳),(绿色),[规划],[行动策略],[战略],[推进],[持续],[理念],[建设],[健全],[完善],[行动],[融入],[围绕]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳减排管理",
                        "三级指标": [
                            {
                                "三级指标名称": "企业整体层面碳减排管理",
                                "keywords": "(绿色),(碳),(环保),[制度],[流程],[手册],[行动方案],[环境管理],[发展理念],[管理],[制定],[环保管理],[环境管理],[绿色低碳循环发展],[管理体系],[编制],[管理],[环境保护],[管理制度],[运营],[生产],[减排],[方案],[治理],[体系],[环境友好],[利用]"
                            },
                            {
                                "三级指标名称": "设立专门团队部门",
                                "keywords": "(碳),(环境保护),(环保),(节能减排),(能源管理),(ESG),(绿色),[团队],[小组],[部门],[设立],[组建],[成立],[领导小组],[负责],[委员会],[落实],[组织],[开展],[统筹],[董事会],[工作小组],[管理工作],[下设],[架构],[指导],[专职]"
                            },
                            {
                                "三级指标名称": "团队是否具备碳减排的专业知识",
                                "keywords": "(碳),(ESG),(环保),(温室气体),[技术],[知识],[学识],[技能],[研究],[专业],[治理],[治理培训],[管理人员]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳减排投入",
                        "三级指标": [
                            {
                                "三级指标名称": "节能管理及设备维修保养",
                                "keywords": "节能管理,节能改造,节能降耗,节能,低耗,能耗,节约,能源管理,能源消耗,能效,LED,有效,智能,节省,利用效率,保养"
                            },
                            {
                                "三级指标名称": "设备升级改造",
                                "keywords": "升级,改造,更换,优化,提升,淘汰,技改,高效,替代,技术改造,改善,老旧,替换,先进"
                            },
                            {
                                "三级指标名称": "新能源开发利用",
                                "keywords": "光伏,水能,风能,太阳能,氢能,可再生能源,新能源,清洁能源,电站,风电,储能,再生能源,并网发电,天然气,水电,生物质,蓄能,风光,地热"
                            },
                            {
                                "三级指标名称": "低碳产品研发",
                                "keywords": "绿色创新专利,绿色专利,绿色低碳技术,(绿色),(碳),(环保),[创新],[研发],[制造],[技术],[开发],[设计],[推出],[研究],[革新],[发行],[首创],[创设],[研制],[新进展],[领先]"
                            },
                            {
                                "三级指标名称": "低碳项目投资",
                                "keywords": "(绿色),(碳),(光伏),(新能源),[投资],[联合],[携手建设],[项目],[碳中和债券],[碳减排贷款],[助力],[合作],[支持],[融资],[募集],[签署]"
                            },
                            {
                                "三级指标名称": "罚款",
                                "keywords": "罚款,处罚,环境污染,事故,重大,行政处罚,违规,违反,瞒报,事件,投诉,曝光,负面,缴纳,违法,未发生"
                            },
                            {
                                "三级指标名称": "投入金额（万元）",
                                "keywords": "(环保),(节能),(绿色),(环境保护),[投入],[技改],[支出],[减排支出],[治理支出],[投资额],[专项资金],[资金投入],[资金]"
                            },
                            {
                                "三级指标名称": "投入金额占营业总支出的比例",
                                "keywords": ""
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳排放量",
                        "三级指标": [
                            {
                                "三级指标名称": "范围一碳排放量（万吨二氧化碳当量）",
                                "keywords": "(范围一),(范畴一),[二氧化碳当量],[排放量],[直接]"
                            },
                            {
                                "三级指标名称": "范围二碳排放量",
                                "keywords": "(范围二),(范畴二),[二氧化碳当量],[间接],[外购]"
                            },
                            {
                                "三级指标名称": "范围三碳排放量",
                                "keywords": "(范围三),(范畴三),[二氧化碳当量]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳排放量审验",
                        "三级指标": [
                            {
                                "三级指标名称": "自身内部审验",
                                "keywords": "盘查,核查,核算,碳足迹,内部"
                            },
                            {
                                "三级指标名称": "第三方审验",
                                "keywords": "第三方,EHS,机构,聘请,邀请,审计,委托,审核,外审,(外部),[核查],[盘查]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳抵消量",
                        "三级指标": [
                            {
                                "三级指标名称": "碳汇（植树造林、植被恢复等）",
                                "keywords": "碳汇,生态造林,绿化,公益林,复垦,汇林,植树造林,森林,林业,栽种,绿地,树苗,绿植,生态系统"
                            },
                            {
                                "三级指标名称": "碳捕获与封存",
                                "keywords": "碳捕捉,碳捕获,碳封存,固碳,捕集,CCUS,封存"
                            },
                            {
                                "三级指标名称": "CCER机制抵消量",
                                "keywords": "CCER,抵消"
                            },
                            {
                                "三级指标名称": "碳排放交易量",
                                "keywords": "碳排放交易,绿电,售电,碳排放权交易市场,交易碳排放权,碳配额交易,碳市场交易,碳配额"
                            },
                            {
                                "三级指标名称": "碳排放交易费用",
                                "keywords": "碳排放交易费用,交易额"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳减排绩效",
                        "三级指标": [
                            {
                                "三级指标名称": "绿色金融或绿色信贷",
                                "keywords": "(绿色),(碳),(环保),(ESG),[金融],[信贷],[票据],[债券],[碳中和债],[贷款],[碳账户],[发行],[承销],[融资],[募集],[专项资金],[信贷],[证券],[质押],[票据],[授信],[基金]"
                            },
                            {
                                "三级指标名称": "节约用电量",
                                "keywords": "节约电能,节约电量,节省用电,用电减少,耗电量,节电量,节省电能,外购电力,节约电力,节约用电"
                            },
                            {
                                "三级指标名称": "光伏发电量（满足自身用电需求）",
                                "keywords": "光伏发电,光伏工程发电量,清洁电能,自发电,清洁电量,绿色电力,光伏电站,核能发电,清洁能源发电"
                            },
                            {
                                "三级指标名称": "原材料吨对应碳排放量",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "产量/碳排放量",
                                "keywords": "碳排放量"
                            },
                            {
                                "三级指标名称": "碳排放强度（吨二氧化碳当量/百万营业收入）",
                                "keywords": "碳排放强度,单位营业收入温室气体排放量,单位产品温室气体排放量,温室气体排放强度"
                            },
                            {
                                "三级指标名称": "万元产值能耗",
                                "keywords": "万元产值能耗,能源消耗,综合能耗,能耗强度,可比价,能源强度"
                            },
                            {
                                "三级指标名称": "节约用煤量（万吨）",
                                "keywords": "节约用煤量,节约标准煤,节省标准煤,节约标煤"
                            },
                            {
                                "三级指标名称": "减少的二氧化碳量（万吨）",
                                "keywords": "减少二氧化碳排放,二氧化碳减排,减排二氧化碳,减少二氧化碳,减少排放,减少碳排放量"
                            },
                            {
                                "三级指标名称": "减少的二氧化碳降低百分比",
                                "keywords": "同比降低,下降+%"
                            },
                            {
                                "三级指标名称": "政府补助及专项资金",
                                "keywords": "政府补助,政府支持,补贴,补助"
                            },
                            {
                                "三级指标名称": "获得ISO认证",
                                "keywords": "ISO5001,ISO14064,ISO14001,ISO14067"
                            },
                            {
                                "三级指标名称": "碳减排奖励信息及绿色等各项认证",
                                "keywords": "绿色工厂,绿色建筑,绿色认定,(绿色),(ESG),(碳),(环保),[奖项],[荣获],[证书],[环境管理体系认证],[案例],[获得],[称号],[获评],[入选],[优秀],[颁发],[产品认证],[示范],[金级],[评为],[标杆],[最佳],[先锋],[突出贡献],[荣誉称号],[授予],[领跑者],[公示],[奖],[认证]"
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "政府",
                "需求目的": "制定低碳发展的政策依据；企业碳配额分配依据",
                "二级指标": [
                    {
                        "二级指标名称": "政府目标",
                        "三级指标": [
                            {
                                "三级指标名称": "是否披露响应政府双碳政策",
                                "keywords": "(碳),[助推],[响应],[2060],[贡献],[目标],[3060],[助力],[学习贯彻],[践行],[落实],[积极],[努力争取],[号召],[承诺],[30·60]"
                            },
                            {
                                "三级指标名称": "能源消耗比",
                                "keywords": "能源消耗比"
                            },
                            {
                                "三级指标名称": "对当地碳减排贡献度",
                                "keywords": "超额完成"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳排放产生信息",
                        "三级指标": [
                            {
                                "三级指标名称": "主要碳排放口的名称",
                                "keywords": "排放口,废气,污染物,(温室气体),[主要来源]"
                            },
                            {
                                "三级指标名称": "在线自动监测设备及与生态环境部门联网情况",
                                "keywords": "环境信息,自动检测,实时,在线,数据中心,智能管理,污染物分析,联网,(碳),(环境),(能源),(污染物),[监测],[监控],[检测]"
                            },
                            {
                                "三级指标名称": "碳排放小时浓度的年度平均值",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "全年生产天数",
                                "keywords": "全年生产"
                            },
                            {
                                "三级指标名称": "自行监测天数",
                                "keywords": "自行监测"
                            },
                            {
                                "三级指标名称": "达标次数",
                                "keywords": "(碳),[达标]"
                            },
                            {
                                "三级指标名称": "超标次数",
                                "keywords": "(碳),[超标]"
                            },
                            {
                                "三级指标名称": "委托的第三方检（监）测机构的信息",
                                "keywords": "(第三方),(委托),[环境监测],[监测]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳排放盘查",
                        "三级指标": [
                            {
                                "三级指标名称": "基准年",
                                "keywords": "基准年,标准年,基准"
                            },
                            {
                                "三级指标名称": "阐述引起基准年排放量重算的重大变化",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "识别碳排放源头（排放设施）",
                                "keywords": "排放源"
                            },
                            {
                                "三级指标名称": "碳排放核算方法（股权比例 VS 控制权法）",
                                "keywords": "核算范围"
                            },
                            {
                                "三级指标名称": "收集活动数据和选择排放因子",
                                "keywords": "(温室气体),[指南],[排放因子]"
                            },
                            {
                                "三级指标名称": "碳排放数据采集流程",
                                "keywords": "(碳),[信息化],[工序]"
                            },
                            {
                                "三级指标名称": "能源消耗情况明细（可按照业务单元、国家、排放源类型、活动类型等细分）",
                                "keywords": "消耗量,能源使用,综合能源,能源类型,结构占比"
                            },
                            {
                                "三级指标名称": "能源消耗总量",
                                "keywords": "能源消耗总量,能源消耗密度,能源消费量,总能耗,综合能耗"
                            },
                            {
                                "三级指标名称": "碳排放量总量（万吨）",
                                "keywords": "碳排放总量,温室气体排放量,二氧化碳排放量,温室气体排放"
                            },
                            {
                                "三级指标名称": "历史碳排放量（基准年至报告年）",
                                "keywords": "历史碳排放量"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳配额与交易",
                        "三级指标": [
                            {
                                "三级指标名称": "是否纳入重点排放单位",
                                "keywords": "重点排放单位,控制目标"
                            },
                            {
                                "三级指标名称": "重点排放单位的碳配额量",
                                "keywords": "碳排放额度"
                            },
                            {
                                "三级指标名称": "配额清缴情况",
                                "keywords": "清缴,履约"
                            },
                            {
                                "三级指标名称": "碳交易价格",
                                "keywords": "碳交易价格"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "模范带头作用",
                        "三级指标": [
                            {
                                "三级指标名称": "带动其他企业",
                                "keywords": "(绿色),(碳),(环保),[牵头],[带动],[倡导],[绿色供应链],[号召],[携手],[供应商],[供应链],[共同],[联盟],[参与],[合作],[伙伴],[引导],[发布],[倡议]"
                            },
                            {
                                "三级指标名称": "低碳技术推广",
                                "keywords": "(绿色),(碳),(光伏),[论坛],[受邀],[分享],[出席],[交流],[推广],[大会],[普及],[受邀],[研讨会],[探讨]"
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "员工",
                "需求目的": "在工作中帮助企业实现低碳的依据",
                "二级指标": [
                    {
                        "二级指标名称": "招聘与选拔",
                        "三级指标": [
                            {
                                "三级指标名称": "职位说明中包含低碳议题",
                                "keywords": "(碳),(绿色),[招聘],[人才],[引进],[专业],[招录],[培养],[毕业生]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "培训开发",
                        "三级指标": [
                            {
                                "三级指标名称": "低碳愿景和使命",
                                "keywords": "(绿色),(环保),(低碳),[愿景],[方针]"
                            },
                            {
                                "三级指标名称": "低碳活动",
                                "keywords": "(低碳),(绿色),(环保),(环境),(节能),[活动],[竞赛],[横幅],[分享],[开展],[垃圾分类],[宣传],[意识],[全员],[倡导],[营造],[行动],[氛围],[宣传周],[理念],[宣传教育],[教育]"
                            },
                            {
                                "三级指标名称": "低碳管理技能培训",
                                "keywords": "(环保),(绿色),(碳),(节能),[培训],[专题],[知识],[学习],[培训班],[专家]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "绩效管理与评估",
                        "三级指标": [
                            {
                                "三级指标名称": "低碳绩效是否纳入绩效管理系统",
                                "keywords": "(环保),(节能),(碳),[打分],[考核],[评价],[绩效],[奖励],[挂钩],[责任制],[考评],[责任人],[绩效考核],[奖惩],[考核办法],[责任书],[指标化]"
                            },
                            {
                                "三级指标名称": "与员工沟通低碳目标和责任",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "构建低碳产出目标，设立惩罚制度",
                                "keywords": ""
                            }
                        ]
                    },
                    {
                        "二级指标名称": "薪酬与福利",
                        "三级指标": [
                            {
                                "三级指标名称": "货币性薪酬",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "非货币性薪酬",
                                "keywords": ""
                            }
                        ]
                    },
                    {
                        "二级指标名称": "员工参与",
                        "三级指标": [
                            {
                                "三级指标名称": "增强员工授权（例如员工参与等）",
                                "keywords": "征集,想法,鼓励"
                            },
                            {
                                "三级指标名称": "绿色办公（节约用电、废纸、资源回收、减少浪费，无纸化办公等）",
                                "keywords": "绿色办公,节约用电,废纸,资源回收,减少浪费,循环利用,资源节约,绿色运营,绿色环保办公,节水,省电,电子材料,碳足迹,节约用水,绿色出行,无纸化,倡导,纸张,线上,出行,双面,纸质,电子,视频会议,打印,日常,电子化,张贴,办公用品,节约用电,随手关灯,杜绝,光盘行动,办公,班车,节约用纸,重复利用,低碳出行"
                            },
                            {
                                "三级指标名称": "鼓励员工提低碳方面的建议",
                                "keywords": "(碳),(绿色),[建议],[意见],[金点子],[建言献策],[共创],[参与]"
                            },
                            {
                                "三级指标名称": "员工满意度调查",
                                "keywords": "员工满意度"
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "消费者或客户",
                "需求目的": "在消费市场购买产品的决策依据",
                "二级指标": [
                    {
                        "二级指标名称": "低碳产品",
                        "三级指标": [
                            {
                                "三级指标名称": "产品设计研发",
                                "keywords": "绿色产品研发,绿色建筑,材料,绿色施工,产品设计"
                            },
                            {
                                "三级指标名称": "产品制造",
                                "keywords": "产品制造,节能制造,节能生产,产品生产,制造过程,碳循环"
                            },
                            {
                                "三级指标名称": "产品包装与运输",
                                "keywords": "(环保),(绿色),(碳),(循环),(回收),[运输],[包装],[包装材料],[物流],[包材],[纸箱],[减量化],[仓储],[轻量化],[配送],[可降解],[产品包装],[包装物],[包装袋],[包装箱],[装卸],[分拣],[中转]"
                            },
                            {
                                "三级指标名称": "清晰、可靠、量化的低碳产品信息",
                                "keywords": "硅片,低碳产品,绿色产品,生命周期"
                            },
                            {
                                "三级指标名称": "低碳广告、低碳公关",
                                "keywords": "(绿色),(低碳),[品牌],[宣传],[打造],[形象],[影响力],[宣传片],[营销],[广告],[宣传语]"
                            },
                            {
                                "三级指标名称": "低碳产品认证",
                                "keywords": "碳足迹证书,绿色设计产品,绿色建材,碳足迹认证,(绿色),(低碳),(环保),[产品认证]"
                            },
                            {
                                "三级指标名称": "低碳产品价格",
                                "keywords": "低碳产品价格"
                            },
                            {
                                "三级指标名称": "低碳标识（容易辨识）",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "产品的循环利用和回收体系",
                                "keywords": "回收,循环,利用,拆解,废旧,报废,再生,以旧换新,废弃,可回收,再生资源,再循环,闭环"
                            },
                            {
                                "三级指标名称": "分配给产品的碳排放量",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "产品功能碳排放量",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "销售额对应碳排放量",
                                "keywords": ""
                            }
                        ]
                    },
                    {
                        "二级指标名称": "消费者服务",
                        "三级指标": [
                            {
                                "三级指标名称": "传达简约、高品质和健康的生活方式",
                                "keywords": "垃圾分类,(绿色),(碳),[生活方式],[贯穿],[全过程],[绿色生活],[出行],[绿色消费],[减少能耗]"
                            },
                            {
                                "三级指标名称": "强调负责任、无污染的原材料",
                                "keywords": "有害物质,抽测,符合标准,声明,化学成分"
                            },
                            {
                                "三级指标名称": "强调清洁生产",
                                "keywords": "生产"
                            },
                            {
                                "三级指标名称": "消费者的减碳贡献",
                                "keywords": "碳积分,个人客户,旅客,兑换,绿色能量"
                            },
                            {
                                "三级指标名称": "消费者满意度调查",
                                "keywords": "(绿色),(低碳),[问卷],[现场测试],[客户感知],[问卷调查],[现场],[感知]"
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "社区",
                "需求目的": "在消费市场或者资本市场做出消费、投资决策的依据",
                "二级指标": [
                    {
                        "二级指标名称": "低碳公益服务",
                        "三级指标": [
                            {
                                "三级指标名称": "志愿者低碳服务",
                                "keywords": "(绿色),(环保),(低碳),(环境),[志愿者],[公益活动],[公益],[行动],[实际行动],[保护]"
                            },
                            {
                                "三级指标名称": "推广公众低碳意识",
                                "keywords": "倡导绿色理念,(环保),(绿色),(低碳),(环境),[社会],[全民],[公众],[社区],[培养],[零废弃],[普及],[地球],[广大群众]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳公益捐赠",
                        "三级指标": [
                            {
                                "三级指标名称": "低碳项目专项捐赠",
                                "keywords": "(光伏),(绿色),(低碳),[出资],[捐赠],[助力建设],[公益林],[扶贫],[基金会],[脱贫],[慈善]"
                            },
                            {
                                "三级指标名称": "为社区捐赠低碳物资",
                                "keywords": "捐赠光伏组件,旧衣物"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳科技发展信息",
                        "三级指标": [
                            {
                                "三级指标名称": "与高校科研院所进行低碳项目合作",
                                "keywords": "(低碳),(绿色),(新能源),(环保),[高校],[研究],[大学],[实验室],[合作],[研究所],[产学研],[研究院],[学校],[校企]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "释放无关紧要的道德信息",
                        "三级指标": [
                            {
                                "三级指标名称": "发布植树活动",
                                "keywords": "植树活动,绿化,种植,防沙,捐种,植树造林,树木,植被,栽种,绿植,植树节,种下,养护,沙漠"
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "供应商",
                "需求目的": "在供应链上与企业持续合作的决策依据",
                "二级指标": [
                    {
                        "二级指标名称": "低碳采购与参与",
                        "三级指标": [
                            {
                                "三级指标名称": "供应商产品是否为低碳产品",
                                "keywords": "低碳产品供应,绿色供应,环保风险等级,分层管控,采购,准入,供应商评估,优先选择,招标,考察,合格"
                            },
                            {
                                "三级指标名称": "绿色运输",
                                "keywords": "(绿色),(碳),(环保),[运输],[包装],[包装材料],[物流],[包材],[循环],[纸箱],[回收],[减量化],[仓储],[轻量化],[配送],[可降解],[承运],[冷链物流]"
                            },
                            {
                                "三级指标名称": "供应商是否获得低碳认证",
                                "keywords": "(绿色),(碳),(节能),[资质],[供应商认证],[准入],[绿名单],[供应商评价],[审查供应商],[筛选]"
                            },
                            {
                                "三级指标名称": "推广提高供应商对低碳的认识",
                                "keywords": "绿色供应链,绿色采购,(绿色),(节能),(低碳),[倡议书],[产业链],[共同推动],[上下游],[协同]"
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳激励",
                        "三级指标": [
                            {
                                "三级指标名称": "碳减排业绩纳入供应商奖励计划",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "与供应商相关的范围三碳排放量",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "向减少运营排放量（范围一和二）的供应商提供财务激励",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "向减少下游排放量（范围三）的供应商提供财务激励",
                                "keywords": ""
                            },
                            {
                                "三级指标名称": "向减少上游排放量（范围三）的供应商提供财务激励",
                                "keywords": ""
                            }
                        ]
                    }
                ]
    }
]

system_2_indicators = [
    {
        "一级指标": "确碳",
                "二级指标": [
                    {
                        "二级指标名称": "碳盘查",
                        "三级指标": [
                            {
                                "三级指标名称": "确定碳排放核算责任的组织边界(依据控制法或股权法)",
                                "keywords": "(碳),(温室气体),[组织边界],[纳入所属公司],[部门]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "设定了组织边界，赋值为1；否则为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "确定碳排放核算责任的运营边界（依据范围一、范围二、范围三界定）",
                                "keywords": "(碳),(温室气体),[范围一],[范围二],[范围三],[范畴一],[范畴二],[范畴三],[直接排放],[间接排放],[排放量]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "企业碳排放涵盖范围一、二、三的，赋值为3；涵盖2个范围的，赋值为2；涵盖1个范围，赋值为1；未界定核算范围的，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "识别和归集企业内部部门、部门人员碳排放源和责任范围（范围一、范围二）",
                                "keywords": "(碳),(温室气体),[排放源],[排放量],[部门],[员工],[责任],[识别],[分配]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "识别和归集企业在供应链系统中碳排放源和责任范围（范围三）",
                                "keywords": "(碳),(温室气体),[排放源],[排放量],[供应链],[上下游],[供应商],[责任]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "收集和计算碳排放量的核算方法学和标准",
                                "keywords": "(碳),(温室气体),(能源),[碳排放核算方法],[温室气体核算体系],[ISO14064],[ISO14064],[PAS],[2050],[工业企业温室气体排放核算和报告通则],[温室气体排放核算方法与报告指南],[省级温室气体清单编制指南],[综合能耗计算通则],[大型碳中和实施指南],[指南],[核算方法]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "有核算方法和标准，赋值为1；无，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳监测",
                        "三级指标": [
                            {
                                "三级指标名称": "有专业的碳排放统计监测系统、平台来监测、收集和分析碳排放数据",
                                "keywords": "(碳),(温室气体),[监测],[监控],[统计监测系统],[监测平台],[大数据],[数字化]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳核查",
                        "三级指标": [
                            {
                                "三级指标名称": "设有内部审核机构进行碳排放核算和报告的内部审核",
                                "keywords": "(碳),(温室气体),[碳盘查],[核查],[内部审核],[内部审验],[自身审核],[自身审验]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "按照相关政府部门碳核查要求进行了碳核查或者通过第三方审验或认证",
                                "keywords": "(碳),(温室气体),[碳核查],[第三方审验],[第三方认证],[外部核查],[聘请],[委托],[邀请],[审计],[审核],[审验]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "基准年碳排放评估",
                        "三级指标": [
                            {
                                "三级指标名称": "是否设置了基准年（年份）",
                                "keywords": "(碳),(温室气体),[基准年],[标准年],[基准],[参考年]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳政策响应",
                        "三级指标": [
                            {
                                "三级指标名称": "企业以国家双碳目标为导向，积极响应和执行政府颁布的双碳目标政策、目标等",
                                "keywords": "(碳),(温室气体),(气候),[中国],[国家],[我国],[双碳],[碳中和],[碳中和碳达峰],[30-60],[3060],[零碳],[目标],[响应],[助力],[落实],[推动],[助推],[响应],[贡献],[目标],[学习贯彻],[践行],[落实],[积极],[努力争取],[号召],[承诺]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "提及双碳目标，赋值为1；无描述，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "企业对政府颁布的年度重大减排政策、计划、目标等的响应程度",
                                "keywords": "(清洁能源),(能源),(能耗),(节能),(绿色),(环保),[中国],[国家],[我国],[能耗双控],[限电],[节能技改],[目标],[规划]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "提及政府相关减排政策的，赋值为1；无描述，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "价值观、原则与准则信息",
                        "三级指标": [
                            {
                                "三级指标名称": "把碳减排理念融入企业整体价值观、行为准则中",
                                "keywords": "(碳),(温室气体),(气候),(节能),(能源),(环保),(绿色),[使命],[愿景],[核心价值观],[文化],[企业整体发展战略],[理念]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "领导力和认知（决策层）",
                        "三级指标": [
                            {
                                "三级指标名称": "高管有关双碳目标或碳减排的声明与承诺",
                                "keywords": "(碳),(气候),(节能),(能源),(环保),(绿色),[董事长致辞],[管理层致辞],[致辞]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "董事会层面的机构设置和工作机制",
                                "keywords": "(碳),(气候),(节能),(节能减排),(能源),(ESG),(可持续发展),(环境保护),(环保),(绿色),[管理],[管理工作],[部门],[机构],[委员会],[小组],[团队],[董事],[董事会],[领导小组],[负责],[组织],[开展],[统筹],[下设],[架构],[指导],[专职],[设立],[组建],[成立],[负责],[落实]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "任命董事会级别角色担任碳中和管理机构的负责人",
                                "keywords": "(碳),(气候),(节能),(节能减排),(能源),(环境保护),(环保),(ESG),(可持续发展),[董事],[牵头],[担任],[负责]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳中和管理体系（管理层）",
                        "三级指标": [
                            {
                                "三级指标名称": "管理层面的机构设置和工作机制",
                                "keywords": "(碳),(气候),(节能),(节能减排),(能源),(环境保护),(ESG),(可持续发展),(环保),(绿色),[管理者],[责任],[负责],[技术],[知识],[技能],[专业]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "制定双碳、低碳或能源管理制度体系，包括管理方法、程序或步骤等信息",
                                "keywords": "(碳),(气候),(节能),(节能减排),(能源),(环境保护),(ESG),(可持续发展),(环保),(绿色),[制定],[编制],[制度],[规章],[行动纲领],[管理],[方法]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳排放管理体系认证情况",
                        "三级指标": [
                            {
                                "三级指标名称": "通过温室气体管理体系（ISO14064）认证、产品碳足迹认证（ISO 14067）、能源管理体系（ISO50001）认证、环境管理体系（ISO14001）认证的情况",
                                "keywords": "(温室气体管理体系认证),(ISO14064),(产品碳足迹认证),(ISO),(14067),(能源管理体系认证),(ISO50001),(环境管理体系认证),(ISO14001),[认证]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "获得认证的数量",
                                "最高分": 4
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳中和培训机制",
                        "三级指标": [
                            {
                                "三级指标名称": "制定碳中和或碳减排培训体系",
                                "keywords": "碳,气候,节能,节能减排,能源,环境保护,ESG,可持续发展,环保,绿色",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "应对气候变化风险与机遇识别",
                        "三级指标": [
                            {
                                "三级指标名称": "是否将此类气候变化流程纳入企业的整体风险管理系统或流程",
                                "keywords": "(碳),(气候),(极端气候),(能源),(节能),(环保),(绿色),[管理],[管理流程],[风险],[风险管理]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "具有识别、评估和管理气候变化风险相关的风险管理机制（制度或流程（包括潜在风险分类识别、风险准则、确定重要性等级、制定应对措施））",
                                "keywords": "(碳),(气候),(极端气候),(能源),(节能),(环保),(绿色),[识别],[评估],[分类识别],[风险准则],[确定重要等级],[制定应对措施],[机制],[制度],[流程]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "识别和评估了气候相关风险和风险类别清单（政策与法律、市场、技术、声誉、物理风险）",
                                "keywords": "(碳),(气候),(极端气候),(能源),(节能),(环保),(绿色),[识别],[评估],[类别],[清单],[气候风险],[政策风险],[法律风险],[法规风险],[市场风险],[技术风险],[声誉风险],[物理风险],[环境风险],[环保风险],[碳中和风险],[TCFD],[转型],[测试],[披露],[声誉],[应急],[情景],[压力]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "识别和评估了应对气候变化机遇及其类别清单（资源效率、能源来源、产品与服务、市场机遇、财务、适应能力等）",
                                "keywords": "(碳),(气候),(能源),(节能),(环保),(绿色),[提高],[降低],[把握],[机遇],[机会],[竞争优势],[成本节约],[减少成本],[降低成本],[增加收入],[资源效率],[能源效率],[产品与服务],[市场机遇],[收入],[适应能力],[转型应对],[适应力],[挑战],[发展趋势],[发展前景]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "利益相关者沟通中识别了与双碳目标或低碳有关的利益相关者及其期望",
                                "keywords": "定位：,(碳),(气候),(能源),(节能),(环保),(绿色),[利益相关者沟通],[相关者沟通]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "对应业务与重大风险",
                        "三级指标": [
                            {
                                "三级指标名称": "重大气候风险与机遇对业务、战略、财务和运营管理实际和潜在影响",
                                "keywords": "(碳),(气候),(能源),(节能),(环保),(绿色),[业务],[战略],[财务],[运营管理],[财务风险],[成本增加],[价格],[浮动],[研发成本],[研发投入],[营业收入],[财务],[业绩],[利润],[绩效],[市场],[业务],[需求],[投资组合价值],[投资],[利益],[收入],[成本],[经营],[营业],[损失],[资产],[运营]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "制定风险与机遇应对措施",
                                "keywords": "(碳),(气候),(能源),(节能),(环保),(绿色),[制定],[应对],[应对措施],[发展],[推动],[践行],[打造],[贯彻],[加快],[深耕],[不断完善],[坚持],[继续],[探索],[构建],[新阶段],[贡献力量],[进一步],[引领]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "摸排碳减排潜力",
                        "三级指标": [
                            {
                                "三级指标名称": "是否进行碳减排潜力及成本分析",
                                "keywords": "(碳),(温室气体),[碳减排潜力],[减排潜力],[成本],[分析],[评估]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "战略目标",
                        "三级指标": [
                            {
                                "三级指标名称": "是否将双碳目标或碳减排目标纳入公司整体战略规划中",
                                "keywords": "(碳),(气候),(能源),(节能),(环保),(绿色),[战略],[规划],[计划],[目标],[整体],[规划],[行动策略],[推进],[持续],[理念],[建设],[健全],[完善],[行动],[融入],[围绕]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "设定碳排放目标类型",
                                "keywords": "(碳中和),(2030),(2060),(碳达峰),(零碳),(碳减排),(减碳),(碳抵消),(碳交易),(碳排放强度),(碳效率),(万元营业收入温室气体排放),(万元营业收入碳排放),(万元产值碳排放),(碳足迹),[目标],[计划],[预计],[拟],[减少],[降低],[下降],[实现],[达到],[争取],[力争],[承诺],[致力于],[变革],[长期],[2025],[2045],[2050],[基准],[逐年],[递减],[完成],[升级]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字",
                                "终端采分方法": "同时设定了短期、中长期目标，赋值为2；仅设定其中一种目标，赋值为1；未设定目标，赋值为0",
                                "最高分": 2
                            },
                            {
                                "三级指标名称": "是否设定碳达峰、碳中和年份",
                                "keywords": "(碳中和),(碳达峰),[预计],[拟],[实现],[达到],[争取],[力争],[承诺],[先于],[早于],[年],[2030],[2060],[2025],[2045],[2050]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字",
                                "终端采分方法": "设定了碳达峰、碳中和年份，赋值为1；否则为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "其他气候相关目标",
                                "keywords": "(能源利用效率),(万元产值综合能耗),(低碳能源消耗),[目标],[增加],[提升],[降低],[计划],[预计],[拟],[减少],[降低],[下降],[实现],[达到],[争取],[力争],[承诺],[致力于],[逐年],[递减],[完成]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "基于“科学碳目标倡议SBTI”设定的目标并得到认证",
                                "keywords": "科学碳目标倡议,SBTI",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "设定碳抵消使用目标",
                                "keywords": "(碳抵消),(碳市场),(碳配额),(碳汇),(CCER),(碳捕获),(利用与封存技术),(CCUR),[目标],[增加],[提升],[降低],[计划],[预计],[拟],[减少],[降低],[下降],[实现],[达到],[争取],[力争],[承诺],[致力于],[逐年],[递减],[完成]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "内部分解碳中和目标和责任，分配和落实到内部的部门和部门人员（范围一、范围二）",
                                "keywords": "(碳),(能源),[内部],[部门],[员工],[人员],[目标],[责任],[分配],[落实],[负责]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "主动考虑或共同承担供应链系统中的碳中和目标和责任的确认和分配（范围三）",
                                "keywords": "(供应链),(上下游),(供应商),[目标],[责任],[分配],[合作],[负责],[承担]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "行动方案",
                        "三级指标": [
                            {
                                "三级指标名称": "制定了迈向双碳目标或碳减排目标过程的路径、行动方案",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),[行动方案],[行动策略],[路线图],[路径],[方案],[策略],[流程],[手册],[规划],[应对策略],[编制],[制定]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "减碳",
                "二级指标": [
                    {
                        "二级指标名称": "激励机制",
                        "三级指标": [
                            {
                                "三级指标名称": "将节能低碳公司绩效管理系统（包括纳入管理层绩效考核体系）",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),[绩效],[考核],[责任制],[制度],[打分],[评价],[挂钩],[考评],[责任人]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "制定员工碳减排责任与目标，设立奖惩激励制度",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),[奖励],[惩罚]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "管理者及员工碳减排绩效考核与薪酬奖金挂钩",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),[薪酬],[奖金],[挂钩]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "管理者及员工碳减排绩效考核与称号等挂钩",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),[称号],[挂钩]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "保障支撑",
                        "三级指标": [
                            {
                                "三级指标名称": "应用数字化智慧化管理平台，涉及应用数字化能源或碳管理工具、平台",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),[数字化],[信息化],[智能化],[平台]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳运营",
                        "三级指标": [
                            {
                                "三级指标名称": "低碳办公，实现节能降碳",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[绿色办公],[办公],[节约用电],[电子化减少纸张使用]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "低碳建筑，实现节能降碳",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[房屋],[建筑],[供热],[供暖],[电力],[光伏],[节能建筑],[房屋照明系统],[部署更节能低碳的建筑电力管理系统],[能效更高的供冷供暖系统]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "获得国家级或省级绿色工厂认证，实现节能降碳",
                                "keywords": "(绿色工厂),(绿色建筑),(绿色生产基地),[认证],[荣获],[具有],[拥有],[通过]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "低碳化交通物流运营并使用新能源，实现节能降碳",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[物流],[员工],[差旅],[车辆],[电气化],[节约用电],[废纸],[资源回收],[减少浪费],[循环利用],[资源节约],[绿色运营],[绿色环保办公],[节水],[省电],[电子材料],[绿色出行],[无纸化],[线上],[双面],[电子],[视频会议]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳工艺",
                        "三级指标": [
                            {
                                "三级指标名称": "落后耗能设备淘汰或改进，购买低碳节能设备，提高能源资源利用效率，实现节能降碳增效",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[设备],[淘汰],[改进],[升级],[更换],[优化],[提升],[落后设备],[节能设备]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "生产工艺流程改进，采取清洁生产工艺，提高能源资源利用效率，实现节能降碳增效",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[生产],[工艺],[清洁生产],[改进],[升级],[更换],[优化],[提升]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "技术改进，采取低碳节能技术，提高能源资源利用效率，实现节能降碳增效",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[技改],[技术改造],[节能技术],[利用效率]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "采取循环经济生产方式，实现碳密集废弃物减少与物料循环，提高能源资源利用效率，实现节能降碳增效",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[循环],[回收],[利用],[废弃物]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳创新",
                        "三级指标": [
                            {
                                "三级指标名称": "开发节能低碳新产品，减少其在生产和使用过程中碳足迹，实现节能降碳增效",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[低碳产品],[节能产品],[新产品],[绿色创新],[绿色专利],[绿色技术],[低碳技术],[技术],[创新],[研发],[开发],[设计],[制造]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "改进现有产品，减少其在生产和使用过程中碳足迹，实现节能降碳增效",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[产品],[商品],[材料],[产品改进],[升级],[材料减量],[低碳原材料替代],[创新]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为1",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "开发利用可再生能源",
                                "keywords": "光伏,电气化,氢能,生物质能,核电,热能,风能,水能,太阳能,发电,储能,风电,绿电,可再生能源,新能源,清洁能源的开发,投资,使用",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为2",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "投资应对气候变化项目",
                                "keywords": "低碳项目,负碳项目,氢能项目,CCUS项目,清洁能源,项目,开发,研发,投资,支持,助力,合作,联合,携手",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "开发碳金融产品",
                                "keywords": "碳中和债,碳债券,碳信托,碳信贷,碳质押,碳抵押,碳金融衍生品,绿色债券,绿色金融,绿色信贷,发行,承销,融资,募集,资金,(碳中和),[绿色票据]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "建立内部碳价机制",
                                "keywords": "(碳),(内部碳定价),[内部],[定价],[价格],[价值]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳产品",
                        "三级指标": [
                            {
                                "三级指标名称": "单一产品全生命周期碳足迹说明",
                                "keywords": "(碳足迹),[报告],[证书],[认证]",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "碳标签",
                                "keywords": "(碳),(温室气体),(能源),[碳标签],[碳信息],[标签],[标识]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "低碳产品认证",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[认证],[绿色产品],[绿色设计],[绿色建材],[绿色建筑]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "获得低碳产品认证，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "低碳产品广告，向消费者传递低碳消费意识",
                                "keywords": "广告,宣传,品牌,形象,影响力",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳供应链",
                        "三级指标": [
                            {
                                "三级指标名称": "制定供应商碳管理制度，明确告知供应商企业的采购环保低碳标准和管理要求、要求供应商实施碳排放管理体系并报告碳排放情况",
                                "keywords": "(供应商),(供应链),[管理制度],[制度],[手册],[体系]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "对供应商进行碳排放相关培训，涉及相关低碳政策、标准和核算方法、碳管理、碳减排技术指导等",
                                "keywords": "(供应商),(供应链),[培训],[宣传],[学习],[知识],[专题]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "将低碳绩效纳入供应商奖励",
                                "keywords": "(供应商),(供应链),[绩效],[考核],[奖励],[惩罚],[处罚]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "与上下游供应链合作设定双碳目标或碳减排目标",
                                "keywords": "(供应商),(供应链),[目标],[设定]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "与上下游供应链合作开发绿色低碳产品或技术，实现节能降碳增效",
                                "keywords": "(供应商),(供应链),[参与],[合作],[开发],[产品],[技术]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳公益",
                        "三级指标": [
                            {
                                "三级指标名称": "参与行业低碳相关标准制定",
                                "keywords": "标准,指南,制定,参与",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "低碳志愿活动",
                                "keywords": "公益林地,植树造林,植树,造林",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "低碳技术推广",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[推广],[带领],[大会],[论坛],[受邀],[分享],[出席],[交流]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "抵碳",
                "二级指标": [
                    {
                        "二级指标名称": "碳抵消管理体系",
                        "三级指标": [
                            {
                                "三级指标名称": "建立了碳资产管理制度",
                                "keywords": "(碳资产),(碳排放配额),(碳交易),[制定],[编制],[制度],[规章],[行动纲领],[管理],[方法]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "设立了碳资产管理部门",
                                "keywords": "(碳交易),[工作],[部门],[机构],[委员会],[小组],[团队],[董事],[董事会],[领导小组]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "固碳抵消",
                        "三级指标": [
                            {
                                "三级指标名称": "通过植树造林等林业碳汇、海洋碳汇等进行碳抵消",
                                "keywords": "碳汇,植树造林,植被恢复,造林,再造林,碳抵消",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            },
                            {
                                "三级指标名称": "开发利用碳捕获、利用与封存技术（CCUS）进行碳抵消",
                                "keywords": "固碳,碳捕获,利用与封存技术,CCUS,碳捕获碳捕捉,碳捕集,封存,碳抵消",
                                "计分方法分类（关键词+数字+字数）": "关键词+数字+字数",
                                "终端采分方法": "定量描述（货币/数值型描述），赋值为3；详细定性，赋值为2；简单定性，赋值为1；无描述，赋值为0",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "CCER与交易",
                        "三级指标": [
                            {
                                "三级指标名称": "申请国家核证自愿减排量CCER（针对自愿参与碳排放交易单位）（万吨二氧化碳当量）",
                                "keywords": "国家核证自愿减排量,CCER",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "申请核证，赋值为1；否则为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "碳配额与交易",
                        "三级指标": [
                            {
                                "三级指标名称": "是否参与碳市场的碳排放交易",
                                "keywords": "碳排放交易,参与",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "是否完成碳排放交易履约清缴",
                                "keywords": "(碳),[重点排放单位],[履约],[完成]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "披碳",
                "二级指标": [
                    {
                        "二级指标名称": "相关性",
                        "三级指标": [
                            {
                                "三级指标名称": "企业披露的碳排放量涵盖了组织边界和运营边界以内的总排放量",
                                "keywords": "[三级指标cme1或cme2的值非零],[这里赋值为1]",
                                "计分方法分类（关键词+数字+字数）": "根据上述题项的结果按照公式计算得出",
                                "终端采分方法": "披露了组织边界和运营边界，赋值为2；只披露组织边界或运营边界的，赋值为1；未披露碳排放量的责任边界的，赋值为0",
                                "最高分": 2
                            }
                        ]
                    },
                    {
                        "二级指标名称": "完整性",
                        "三级指标": [
                            {
                                "三级指标名称": "充分披露了企业碳排放相关信息（即完整披露确碳、减碳、抵碳的核心题项）",
                                "keywords": "企业披露占比=三级指标cme1至off74的非零值的数量/74",
                                "计分方法分类（关键词+数字+字数）": "根据上述题项的结果按照公式计算得出",
                                "终端采分方法": "企业披露占比=企业披露了上述确碳、减碳、抵碳的核心题项的数量/总题项数量；企业披露占比大于等于75%，赋值为3，在50%~75%之间，赋值为2，在25%~50%之间，赋值为1，否则，为0",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "量化性",
                        "三级指标": [
                            {
                                "三级指标名称": "使用数字进行信息披露的程度（披露了范围一、范围二、范围三的碳排放量或者能源消耗量（电、煤、石油天然气等）的具体值）",
                                "keywords": "——根据是否披露碳排放量和范围,直接,间接来判断",
                                "计分方法分类（关键词+数字+字数）": "根据上述题项的结果按照公式计算得出",
                                "终端采分方法": "披露了范围一、二、三的，赋值为4；披露了2个范围的，赋值为3；披露了1个范围的，赋值为2；披露了能源消耗量的，赋值为1；具体值得，赋值为0",
                                "最高分": 4
                            }
                        ]
                    },
                    {
                        "二级指标名称": "一致性",
                        "三级指标": [
                            {
                                "三级指标名称": "采取一致的方法学对长期的碳排放情况进行比较",
                                "keywords": "t,t-1,t-2三年的碳排放数据",
                                "计分方法分类（关键词+数字+字数）": "这个不知道计算机技术能否实现",
                                "终端采分方法": "披露连续三年及以上的碳排放的核算方法一致的，赋值1；否则，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "是否采用同行业的碳排放核算方法学（我国已发布《工业企业温室气体排放核算和报告通则》GB/T 32150-2015以及24个行业《温室气体排放核算方法与报告指南(试行)》GB/T 32151）",
                                "keywords": "(碳),(温室企业),(能源),[工业企业温室气体排放核算和报告通则],[温室气体排放核算方法与报告指南],[核算方法],[指南]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "若企业采取同行业的碳排放核算方法学，则赋值为1；否则，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "是否采用同地区的碳排放核算方法学（我国已发布《省级温室气体清单编制指南》（试行）》、各省市发布相关的方法学）",
                                "keywords": "(碳),(温室企业),(能源),[省级温室气体清单编制指南],[省],[市],[核算方法],[指南]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "若企业采取同地区的碳排放核算方法学，则赋值为1；否则，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "准确性",
                        "三级指标": [
                            {
                                "三级指标名称": "有内部审验机构审验碳信息披露报告",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[报告],[内部],[自身],[审核],[审验]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "有第三方权威机构的审验或认证碳信息披露报告",
                                "keywords": "报告,第三方审验,第三方认证,外部核查,聘请,委托,邀请,(碳),[审计]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "参照TCFD气候变化相关财务信息披露或香港联交所《气候信息披露指引》或生态环境部《关于加强企业温室气体排放报告管理相关工作的通知》",
                                "keywords": "TCFD,气候信息披露指引,关于加强企业温室气体排放报告管理相关工作的通知,(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[指引]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "只要参照其中一个信息披露标准，赋值为1；否则，为0",
                                "最高分": 1
                            },
                            {
                                "三级指标名称": "是否参照相关标准披露报告标准索引表",
                                "keywords": "索引表",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "及时性",
                        "三级指标": [
                            {
                                "三级指标名称": "碳信息披露时间（随年报披露、随披露社会责任报告或可持续发展报告、单独披露碳中和报告或路线图）",
                                "keywords": "——通过是否有CSR报告,可持续发展报告,ESG报告来判断",
                                "计分方法分类（关键词+数字+字数）": "",
                                "终端采分方法": "及时响应政策单独披露碳中和报告或路线图为2；披露社会责任报告、可持续发展报告或ESG报告为1；未披露为0",
                                "最高分": 2
                            }
                        ]
                    },
                    {
                        "二级指标名称": "自愿披露情况",
                        "三级指标": [
                            {
                                "三级指标名称": "是否参与CDP信息披露",
                                "keywords": "CDP,参与,参加",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "是，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    }
                ]
    },
    {
        "一级指标": "激碳",
                "二级指标": [
                    {
                        "二级指标名称": "碳中和完成度",
                        "三级指标": [
                            {
                                "三级指标名称": "是否实现年度碳中和",
                                "keywords": "碳中和,实现,完成,碳中和认证",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "核算边界年度碳排放量小于等于用以抵消的碳配额、碳信用、碳汇数量，即可判定达成年度碳中和，赋值为1；反之，则不能判定达成年度碳中和，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "合规性",
                        "三级指标": [
                            {
                                "三级指标名称": "符合国家相关环境法律法规标准要求",
                                "keywords": "(碳),(气候),(能源),(节能),(减排),(环保),(绿色),[合规],[履约],[罚款],[处罚],[污染],[事故],[违规],[违反],[瞒报]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "若受到环境处罚或 有污染物排放不达标或突发重大环境污染事件或环境违法事件或环境信访案件，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    },
                    {
                        "二级指标名称": "股权融资优势",
                        "三级指标": [
                            {
                                "三级指标名称": "企业投资成本",
                                "keywords": "股权融资成本相对位次=融资成本在所有A股同行业上市公司融资成本中所处的位次,若处于大于等于75%的位次,赋值为0,在50%~75%之间,赋值为1,在25%~50%之间,赋值为2,否则,为3",
                                "计分方法分类（关键词+数字+字数）": "第三方数据计算、导入",
                                "终端采分方法": "股权融资成本相对位次=融资成本在所有A股同行业上市公司融资成本中所处的位次；若处于大于等于75%的位次，赋值为0，在50%~75%之间，赋值为1，在25%~50%之间，赋值为2，否则，为3",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "ESG评级",
                        "三级指标": [
                            {
                                "三级指标名称": "wind ESG评级",
                                "keywords": "wind,ESG评级,AA以上,赋值3分,A以上,赋值2分,BB以上赋值1分,B,赋值0分",
                                "计分方法分类（关键词+数字+字数）": "第三方数据计算、导入",
                                "终端采分方法": "wind ESG评级，AA以上，赋值3分，A以上，赋值2分，BB以上赋值1分，B，赋值0分",
                                "最高分": 3
                            }
                        ]
                    },
                    {
                        "二级指标名称": "低碳荣誉",
                        "三级指标": [
                            {
                                "三级指标名称": "获得绿色低碳相关荣誉或奖项",
                                "keywords": "绿色工厂,绿色建筑,绿色认定,(绿色),(ESG),(碳),(环保),[奖项],[荣获],[认证],[绿色工厂],[绿色建筑],[证书],[环境管理体系认证],[案例],[获得],[称号],[获评],[入选],[优秀],[颁发],[产品认证],[示范],[金级],[评为],[标杆],[最佳],[先锋],[突出贡献],[荣誉称号],[授予],[领跑者],[公示]",
                                "计分方法分类（关键词+数字+字数）": "关键词",
                                "终端采分方法": "有获得绿色环境相关奖项，赋值为1；否，赋值为0",
                                "最高分": 1
                            }
                        ]
                    }
                ]
    }
]


class Spider():
    def __init__(self):
        # 等待时间
        self.timeout = 60*60  # 60分钟
        # pdf文件所在的文件夹
        self.pdf_base_path = '/code/media/uploads/pdfs_test'
        self.pno_dict = self.get_pno_dict(filepath='pno.csv')

    def run(self):
        for filename, (pno_start, pno_end) in self.pno_dict.items():
            self.spider(filename, pno_start, pno_end, 1)
            self.spider(filename, pno_start, pno_end, 2)

    def spider(self, filename, pno_start, pno_end, systemId):
        url = "http://101.42.10.168:10086/api/calculate"
        headers = {
            'User-Agent': 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.108 Safari/537.36',
            "Content-Type": "application/json",
        }
        if systemId not in [1, 2]:
            raise Exception("systemId参数错误")

        filepath = os.path.join(self.pdf_base_path, f"{filename}.PDF")
        filepath = filepath.replace("\\", "/")

        data = {
            "files": [
                {
                    "filepath": filepath,
                    "pno_start": pno_start,
                    "pno_end": pno_end
                }
            ],
            "indicators": system_1_indicators if systemId == 1 else system_2_indicators,
            "system": systemId,
            "w1": 1,
            "w2": 1,
            "w3": 1
        }

        # 发送请求
        response = requests.post(url, headers=headers, data=json.dumps(data), timeout=self.timeout)
        response.encoding = response.apparent_encoding

        # 获取响应内容
        content = response.content.decode("unicode_escape")
        content = content.__str__()
        message = re.findall(r'"msg": "(.*?)"', content)
        message = message[0] if len(message) else "Error: 没找到message"
        self.write_to_log(filename, message)

    def get_pno_dict(self, filepath='pno.csv'):
        """
        描述：
            获取pno.csv文件中的数据
        返回值：
            pno_dict: {filename: (pno_start, pno_end)}
        """
        with open(filepath, 'r', encoding='utf-8') as f:
            text = f.read()
        pno_dict = {}
        lines = text.split('\n')
        for line in lines:
            line = line.split(',')

            if len(line) != 3:
                continue

            filename = line[0].strip()
            if filename == "PDF名称":
                continue
            pno_start = line[1].strip() if line[1].strip() != "0" else ""
            pno_end = line[2].strip() if line[2].strip() != "0" else ""
            pno_dict[filename] = (pno_start, pno_end)

        return pno_dict

    def write_to_log(self, filename, info):
        """
        描述：
            将信息写入日志文件
        """
        log_info = f'{filename}\n{info}\n{"#"*10}\n'
        with open('log.txt', 'a', encoding='utf-8') as f:
            f.write(log_info)

        if info == "success":
            my_logger.info(f"{filename} 成功")
        else:
            my_logger.error(f"{filename} 失败 {info}")


if __name__ == '__main__':
    my_logger = Log()
    spider = Spider()
    spider.run()
